SET NAMES UTF8;
DROP DATABASE IF EXISTS thobty;
CREATE DATABASE thobty CHARSET=UTF8;
USE thobty;

#筛选条件:title/class/style/color

#1-1.创建《风格》表
CREATE TABLE thobty_style(
	sid INT PRIMARY KEY AUTO_INCREMENT,		#自增ID
	style VARCHAR(32),										#风格名称
	sty_detail VARCHAR(512)												#风格介绍
);

#1-2.给《风格》表添加数据
INSERT INTO thobty_style VALUES
	(null,'欧美SCHOOL','风格介绍风格介绍'),	#1
	(null,'东方传统','风格介绍风格介绍'),		#2
	(null,'写实素描','风格介绍风格介绍'),		#3
	(null,'现代清新','风格介绍风格介绍'),		#4
	(null,'艺术文字','风格介绍风格介绍'),		#5
	(null,'纹章图腾','风格介绍风格介绍');		#6

#2-1.创建《分类》表
CREATE TABLE thobty_class(
	cid INT PRIMARY KEY AUTO_INCREMENT,		#自增ID
	class VARCHAR(32)											#分类名称
);

#2-2.给《分类》表添加数据
INSERT INTO thobty_class VALUES
	(null,'手稿'),		#1
	(null,'成图');		#2

#3-2.创建《颜色》表
CREATE TABLE thobty_color(
	co_id INT PRIMARY KEY AUTO_INCREMENT,	#自增ID
	color VARCHAR(32)											#颜色名称
);

#3-2.给《颜色》表添加数据
INSERT INTO thobty_color VALUES
	(null,'黑灰'),		#1
	(null,'彩色');		#2

#4-1.创建《门店》表
CREATE TABLE thobty_store(
	st_id INT PRIMARY KEY AUTO_INCREMENT,	#自增ID
	store VARCHAR(32),										#门店名称
	st_detail VARCHAR(512),												#门店介绍
	address VARCHAR(64),											#门店地址
	tel VARCHAR(32),											#门店电话
	store_style_id INT,										#门店风格
	FOREIGN KEY(store_style_id) REFERENCES thobty_style(sid)
		#门店风格，是《风格》表中风格自增ID的外键
);

#4-2.给《门店》表添加数据
INSERT INTO thobty_store VALUES
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',1),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',1),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',2),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',2),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',3),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',3),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',4),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',4),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',5),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',5),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',6),
	(null,'New school','New school，有别于old school ，在92年初期时,出现了一个叫做MOP TOP的黑人舞蹈团体(由Henry Link . Loose  Joint . Buddha Stretch组成),他们发展出一种新风格的我称他为”原地性的hip-hop”他不像MC HAMMER及巴比布朗时期的大动作,劲爆,大范围式的移动，更没有霹雳舞中那些在地上类是体操的动作。','北京市朝阳区三里屯东街一号','13401049837',6);

#5-1.创建《图片》表
CREATE TABLE thobty_pic(
	pid INT PRIMARY KEY AUTO_INCREMENT,		#自增ID
	title VARCHAR(32),										#图片标题
	detail1 VARCHAR(64),									#图片详情1
	detail2 VARCHAR(64),									#图片详情2
	detail3 VARCHAR(64),									#图片详情3
	detail4 VARCHAR(64),									#图片详情4
	detail5 VARCHAR(64),									#图片详情5
	class	VARCHAR(32),										#图片隶属分类
	style	VARCHAR(32),										#图片隶属风格
	color	VARCHAR(32),										#图片隶属颜色
	#每张图片，在网站将显示2种尺寸 -> 430*430 & 950*950
	md VARCHAR(128),											#中图片路径
	lg VARCHAR(128),											#大图片路径
	viewed INT,														#浏览次数
	downloaded INT,												#下载次数
	collected INT,												#收藏次数
	#预留4列以便网站更新，为图片增加列选项(如:单张图/图片作者/购买次数...)
	ext1 VARCHAR(64),
	ext2 VARCHAR(64),
	ext3 VARCHAR(64),
	ext4 VARCHAR(64)
);

#5-2.给《图片》表添加数据
INSERT INTO thobty_pic VALUES
	(null,'欧美手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','欧美SCHOOL','黑灰','img/tattoo/test3/1.jpg','img/tattoo/test3/1.jpg',0,0,0,'','','',''),
	(null,'欧美手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','欧美SCHOOL','黑灰','img/tattoo/test3/2.jpg','img/tattoo/test3/2.jpg',0,0,0,'','','',''),
	(null,'欧美手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','欧美SCHOOL','黑灰','img/tattoo/test3/3.jpg','img/tattoo/test3/3.jpg',0,0,0,'','','',''),
	(null,'欧美手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','欧美SCHOOL','黑灰','img/tattoo/test3/4.jpg','img/tattoo/test3/4.jpg',0,0,0,'','','',''),
	(null,'欧美手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','欧美SCHOOL','黑灰','img/tattoo/test3/5.jpg','img/tattoo/test3/5.jpg',0,0,0,'','','',''),
	(null,'欧美手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','欧美SCHOOL','黑灰','img/tattoo/test3/6.jpg','img/tattoo/test3/6.jpg',0,0,0,'','','',''),
	(null,'欧美手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','欧美SCHOOL','黑灰','img/tattoo/test3/7.jpg','img/tattoo/test3/7.jpg',0,0,0,'','','',''),
	(null,'欧美手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','欧美SCHOOL','黑灰','img/tattoo/test3/8.jpg','img/tattoo/test3/8.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/9.jpg','img/tattoo/test3/9.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/10.jpg','img/tattoo/test3/10.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/11.jpg','img/tattoo/test3/11.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/12.jpg','img/tattoo/test3/12.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/13.jpg','img/tattoo/test3/13.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/14.jpg','img/tattoo/test3/14.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/15.jpg','img/tattoo/test3/15.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/16.jpg','img/tattoo/test3/16.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/17.jpg','img/tattoo/test3/17.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/18.jpg','img/tattoo/test3/18.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/19.jpg','img/tattoo/test3/19.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/20.jpg','img/tattoo/test3/20.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/21.jpg','img/tattoo/test3/21.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/22.jpg','img/tattoo/test3/22.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/23.jpg','img/tattoo/test3/23.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/24.jpg','img/tattoo/test3/24.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/25.jpg','img/tattoo/test3/25.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/26.jpg','img/tattoo/test3/26.jpg',0,0,0,'','','',''),
	(null,'写实成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','写实素描','彩色','img/tattoo/test3/27.jpg','img/tattoo/test3/27.jpg',0,0,0,'','','',''),
	(null,'写实成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','写实素描','彩色','img/tattoo/test3/28.jpg','img/tattoo/test3/28.jpg',0,0,0,'','','',''),
	(null,'写实成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','写实素描','彩色','img/tattoo/test3/29.jpg','img/tattoo/test3/29.jpg',0,0,0,'','','',''),
	(null,'写实成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','写实素描','彩色','img/tattoo/test3/30.jpg','img/tattoo/test3/30.jpg',0,0,0,'','','',''),
	(null,'写实成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','写实素描','彩色','img/tattoo/test3/31.jpg','img/tattoo/test3/31.jpg',0,0,0,'','','',''),
	(null,'写实成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','写实素描','彩色','img/tattoo/test3/32.jpg','img/tattoo/test3/32.jpg',0,0,0,'','','',''),
	(null,'写实成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','写实素描','彩色','img/tattoo/test3/33.jpg','img/tattoo/test3/33.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/34.jpg','img/tattoo/test3/34.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/35.jpg','img/tattoo/test3/35.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/36.jpg','img/tattoo/test3/36.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/37.jpg','img/tattoo/test3/37.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/38.jpg','img/tattoo/test3/38.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/40.jpg','img/tattoo/test3/40.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/41.jpg','img/tattoo/test3/41.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','黑灰','img/tattoo/test3/42.jpg','img/tattoo/test3/42.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','黑灰','img/tattoo/test3/43.jpg','img/tattoo/test3/43.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','黑灰','img/tattoo/test3/44.jpg','img/tattoo/test3/44.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','黑灰','img/tattoo/test3/45.jpg','img/tattoo/test3/45.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','黑灰','img/tattoo/test3/46.jpg','img/tattoo/test3/46.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','黑灰','img/tattoo/test3/47.jpg','img/tattoo/test3/47.jpg',0,0,0,'','','',''),
	(null,'艺术成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','艺术文字','黑灰','img/tattoo/test3/48.jpg','img/tattoo/test3/48.jpg',0,0,0,'','','',''),
	(null,'艺术成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','艺术文字','黑灰','img/tattoo/test3/49.jpg','img/tattoo/test3/49.jpg',0,0,0,'','','',''),
	(null,'艺术成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','艺术文字','黑灰','img/tattoo/test3/50.jpg','img/tattoo/test3/50.jpg',0,0,0,'','','',''),
	(null,'艺术成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','艺术文字','黑灰','img/tattoo/test3/51.jpg','img/tattoo/test3/51.jpg',0,0,0,'','','',''),
	(null,'艺术成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','艺术文字','黑灰','img/tattoo/test3/52.jpg','img/tattoo/test3/52.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/53.jpg','img/tattoo/test3/53.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/54.jpg','img/tattoo/test3/54.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/55.jpg','img/tattoo/test3/55.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/56.jpg','img/tattoo/test3/56.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/57.jpg','img/tattoo/test3/57.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/58.jpg','img/tattoo/test3/58.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/59.jpg','img/tattoo/test3/59.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/60.jpg','img/tattoo/test3/60.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/61.jpg','img/tattoo/test3/61.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/62.jpg','img/tattoo/test3/62.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/63.jpg','img/tattoo/test3/63.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/64.jpg','img/tattoo/test3/64.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/65.jpg','img/tattoo/test3/65.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/66.jpg','img/tattoo/test3/66.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/67.jpg','img/tattoo/test3/67.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/68.jpg','img/tattoo/test3/68.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/69.jpg','img/tattoo/test3/69.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/70.jpg','img/tattoo/test3/70.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/71.jpg','img/tattoo/test3/71.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/72.jpg','img/tattoo/test3/72.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','黑灰','img/tattoo/test3/73.jpg','img/tattoo/test3/73.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/74.jpg','img/tattoo/test3/74.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/75.jpg','img/tattoo/test3/75.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/76.jpg','img/tattoo/test3/76.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/77.jpg','img/tattoo/test3/77.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/78.jpg','img/tattoo/test3/78.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/79.jpg','img/tattoo/test3/79.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/80.jpg','img/tattoo/test3/80.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/81.jpg','img/tattoo/test3/81.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/82.jpg','img/tattoo/test3/82.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/83.jpg','img/tattoo/test3/83.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/84.jpg','img/tattoo/test3/84.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/85.jpg','img/tattoo/test3/85.jpg',0,0,0,'','','',''),
	(null,'现代成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','现代清新','彩色','img/tattoo/test3/86.jpg','img/tattoo/test3/86.jpg',0,0,0,'','','',''),
	(null,'现代手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','现代清新','黑灰','img/tattoo/test3/87.jpg','img/tattoo/test3/87.jpg',0,0,0,'','','',''),
	(null,'现代手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','现代清新','黑灰','img/tattoo/test3/88.jpg','img/tattoo/test3/88.jpg',0,0,0,'','','',''),
	(null,'现代手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','现代清新','黑灰','img/tattoo/test3/89.jpg','img/tattoo/test3/89.jpg',0,0,0,'','','',''),
	(null,'现代手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','现代清新','黑灰','img/tattoo/test3/90.jpg','img/tattoo/test3/90.jpg',0,0,0,'','','',''),
	(null,'现代手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','现代清新','黑灰','img/tattoo/test3/91.jpg','img/tattoo/test3/91.jpg',0,0,0,'','','',''),
	(null,'现代手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','现代清新','黑灰','img/tattoo/test3/92.jpg','img/tattoo/test3/92.jpg',0,0,0,'','','',''),
	(null,'现代手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','现代清新','黑灰','img/tattoo/test3/93.jpg','img/tattoo/test3/93.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/94.jpg','img/tattoo/test3/94.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/95.jpg','img/tattoo/test3/95.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/96.jpg','img/tattoo/test3/96.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/97.jpg','img/tattoo/test3/97.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/98.jpg','img/tattoo/test3/98.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/99.jpg','img/tattoo/test3/99.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','黑灰','img/tattoo/test3/100.jpg','img/tattoo/test3/100.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/101.jpg','img/tattoo/test3/101.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/102.jpg','img/tattoo/test3/102.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/103.jpg','img/tattoo/test3/103.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/104.jpg','img/tattoo/test3/104.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/105.jpg','img/tattoo/test3/105.jpg',0,0,0,'','','',''),
	(null,'文章手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','文章图腾','彩色','img/tattoo/test3/106.jpg','img/tattoo/test3/106.jpg',0,0,0,'','','',''),
	(null,'东方成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','东方传统','彩色','img/tattoo/test3/48.jpg','img/tattoo/test3/48.jpg',0,0,0,'','','',''),
	(null,'东方成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','东方传统','彩色','img/tattoo/test3/108.jpg','img/tattoo/test3/108.jpg',0,0,0,'','','',''),
	(null,'东方成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','东方传统','彩色','img/tattoo/test3/1.jpg','img/tattoo/test3/1.jpg',0,0,0,'','','',''),
	(null,'东方成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','东方传统','彩色','img/tattoo/test3/2.jpg','img/tattoo/test3/2.jpg',0,0,0,'','','',''),
	(null,'东方成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','东方传统','彩色','img/tattoo/test3/3.jpg','img/tattoo/test3/3.jpg',0,0,0,'','','',''),
	(null,'东方成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','东方传统','彩色','img/tattoo/test3/4.jpg','img/tattoo/test3/4.jpg',0,0,0,'','','',''),
	(null,'欧美成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','欧美SCHOOL','黑灰','img/tattoo/test3/5.jpg','img/tattoo/test3/5.jpg',0,0,0,'','','',''),
	(null,'欧美成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','欧美SCHOOL','黑灰','img/tattoo/test3/6.jpg','img/tattoo/test3/6.jpg',0,0,0,'','','',''),
	(null,'欧美成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','欧美SCHOOL','黑灰','img/tattoo/test3/7.jpg','img/tattoo/test3/7.jpg',0,0,0,'','','',''),
	(null,'欧美成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','欧美SCHOOL','黑灰','img/tattoo/test3/8.jpg','img/tattoo/test3/8.jpg',0,0,0,'','','',''),
	(null,'欧美成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','欧美SCHOOL','黑灰','img/tattoo/test3/9.jpg','img/tattoo/test3/9.jpg',0,0,0,'','','',''),
	(null,'欧美成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','欧美SCHOOL','黑灰','img/tattoo/test3/10.jpg','img/tattoo/test3/10.jpg',0,0,0,'','','',''),
	(null,'欧美成图','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','成图','欧美SCHOOL','黑灰','img/tattoo/test3/11.jpg','img/tattoo/test3/11.jpg',0,0,0,'','','',''),
	(null,'写实手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','写实素描','彩色','img/tattoo/test3/12.jpg','img/tattoo/test3/12.jpg',0,0,0,'','','',''),
	(null,'写实手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','写实素描','彩色','img/tattoo/test3/13.jpg','img/tattoo/test3/13.jpg',0,0,0,'','','',''),
	(null,'写实手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','写实素描','彩色','img/tattoo/test3/14.jpg','img/tattoo/test3/14.jpg',0,0,0,'','','',''),
	(null,'写实手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','写实素描','彩色','img/tattoo/test3/15.jpg','img/tattoo/test3/15.jpg',0,0,0,'','','',''),
	(null,'写实手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','写实素描','彩色','img/tattoo/test3/16.jpg','img/tattoo/test3/16.jpg',0,0,0,'','','',''),
	(null,'写实手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','写实素描','彩色','img/tattoo/test3/17.jpg','img/tattoo/test3/17.jpg',0,0,0,'','','',''),
	(null,'写实手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','写实素描','彩色','img/tattoo/test3/18.jpg','img/tattoo/test3/18.jpg',0,0,0,'','','',''),
	(null,'写实手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','写实素描','彩色','img/tattoo/test3/19.jpg','img/tattoo/test3/19.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','彩色','img/tattoo/test3/20.jpg','img/tattoo/test3/20.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','彩色','img/tattoo/test3/21.jpg','img/tattoo/test3/21.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','彩色','img/tattoo/test3/22.jpg','img/tattoo/test3/22.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','彩色','img/tattoo/test3/23.jpg','img/tattoo/test3/23.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','彩色','img/tattoo/test3/24.jpg','img/tattoo/test3/24.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','彩色','img/tattoo/test3/25.jpg','img/tattoo/test3/25.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','彩色','img/tattoo/test3/26.jpg','img/tattoo/test3/26.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','彩色','img/tattoo/test3/27.jpg','img/tattoo/test3/27.jpg',0,0,0,'','','',''),
	(null,'艺术手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','艺术文字','彩色','img/tattoo/test3/28.jpg','img/tattoo/test3/28.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/29.jpg','img/tattoo/test3/29.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/30.jpg','img/tattoo/test3/30.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/31.jpg','img/tattoo/test3/31.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/32.jpg','img/tattoo/test3/32.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/33.jpg','img/tattoo/test3/33.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/34.jpg','img/tattoo/test3/34.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/35.jpg','img/tattoo/test3/35.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/36.jpg','img/tattoo/test3/36.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/37.jpg','img/tattoo/test3/37.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','黑灰','img/tattoo/test3/38.jpg','img/tattoo/test3/38.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/40.jpg','img/tattoo/test3/40.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/41.jpg','img/tattoo/test3/41.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/42.jpg','img/tattoo/test3/42.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/43.jpg','img/tattoo/test3/43.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/44.jpg','img/tattoo/test3/44.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/45.jpg','img/tattoo/test3/45.jpg',0,0,0,'','','',''),
	(null,'东方手稿','图片详情1','图片详情2','图片详情3','图片详情4','图片详情5','手稿','东方传统','彩色','img/tattoo/test3/46.jpg','img/tattoo/test3/46.jpg',0,0,0,'','','','');

#6-1.创建《会员权益》表
CREATE TABLE thobty_membership(
	mid INT PRIMARY KEY AUTO_INCREMENT,		#自增ID
	mlevel VARCHAR(32),										#会员级别
	mship1 VARCHAR(64),									  #会员权益1
	mship2 VARCHAR(64),									  #会员权益2
	mship3 VARCHAR(64),									  #会员权益3
	mship4 VARCHAR(64),									  #会员权益4
	price DECIMAL(5,0)                    #价格
);

#6-2.给《会员权益》表添加数据
INSERT INTO thobty_membership VALUES
	(null,'普通会员','所有图片和矢量文件可用','套餐有效期为一年','图片可永久使用','每个账户限购一次','30'),
	(null,'中级会员','所有图片和矢量文件可用','套餐有效期为一年','图片可永久使用','每个账户限购一次','500'),
	(null,'高级会员','所有图片和矢量文件可用','套餐有效期为一年','图片可永久使用','每个账户限购一次','1000');

#7-1.创建《用户》表
CREATE TABLE thobty_users(
	uid INT PRIMARY KEY AUTO_INCREMENT,		#自增ID
	uname VARCHAR(32),										#用户名
	upwd VARCHAR(32),											#用户密码
	email VARCHAR(128),										#用户邮箱
	token VARCHAR(64),										#账号激活码
	token_exptime INT(10),								#激活码有效期
	status TINYINT(1),										#状态 0-未激活 1-已激活
	regtime DATE,													#注册时间
	ulevel  VARCHAR(32)										#当前用户级别
);

#7-2.给《用户》表添加数据
INSERT INTO thobty_users VALUES
	(null,'Simon','123','435776313@qq.com','','','','','');